//
//  task2D.swift
//  YandexAlgoritms
//
//  Created by Irina Muravyeva on 15.03.2024.
/*
 TaskD. Шахматная доска
 
 Из шахматной доски по границам клеток выпилили связную (не распадающуюся на части) фигуру без дыр. 
 Требуется определить ее периметр.
 
 Формат ввода:
 Сначала вводится число N (1 ≤ N ≤ 64) – количество выпиленных клеток. 
 В следующих N строках вводятся координаты выпиленных клеток,
 разделенные пробелом (номер строки и столбца – числа от 1 до 8).
 Каждая выпиленная клетка указывается один раз.
 
 Формат вывода:
 Выведите одно число – периметр выпиленной фигуры (сторона клетки равна единице).
 
 Данное решение прошло 11 тестов.
 */

import Foundation
